use ssncv;

INSERT INTO `surrounding`
VALUES ('4', '芜湖美食', '[\"二街\",\"凤凰美食街\"]');
update `surrounding`
set content = '[\"107路内环晚班 19:40-22:30\"
,\"109路晚班 19:54-23:14\"
,\"111路晚班 19:25-23:15\"
,\"12路 06:00-19:40\"
,\"16路 06:00-19:00\"
,\"21路 06:00-19:00\"
,\"31路 06:00-19:30\"
,\"42路 06:00-19:00\"
,\"4路 06:30-19:50\",\"6路 06:00-19:20\",\"芜湖-繁昌\"]'
where id = 1;
update `surrounding`
set content = '[\"芜湖市政府 景区北门\",\"第二人民医院 景区南门\",\"皖医二附院 景区东门\",\"第二医院\",\"第五人民医院\",\"芜湖市总工会\"]'
where id = 2;
update `surrounding`
set content = '[\"鸠兹风景区公共厕所一 景区东北角\",\"鸠兹风景区公共厕所二 景区东南角\",\"鸠兹风景区公共厕所三 景区西北角\",\"公共厕所一\",\"公共厕所二\",\"公共厕所三\"]'
where id = 3;
INSERT INTO `surrounding`
VALUES ('5', '购物服务', '[\"华亿国际购物中心A座\",\"华亿国际购物中心B座\",\"三福时尚 景区东门\",\"苏宁易购\",\"世纪联华\"]');

INSERT INTO `spot`
VALUES (2, '干将铸剑赤铸山',
        '干将是春秋时吴国著名的铸剑工艺师。相传干将与莫邪当年曾在芜湖神山设炉，采用当时最先进的渗碳钢技术铸剑。图经》记载：神山，干将淬剑于此，上有磨剑池。现神山公园中存有淬剑石、磨剑池、铁门槛、干将墓等遗址。', null,
        '"assets/file/1556025997024.jpg"', '2019-09-23 21:26:42');
INSERT INTO `spot`
VALUES (3, '南陵古铜冶',
        '古铜冶遗址位于芜湖市南陵县大公山一带，分布面积达几十平方公里。据考证，南陵古铜冶自2700多年前的西周时代一直延续到宋朝，是我国目前发现的规模最大、时间最早、延续年代最久的古铜采掘、冶炼、铸造遗址群，在世界冶金史上具有重要地位。1997年，经国务院公布被列为国家重点文物保护单位。',
        null, '"assets/file/1556025997024.jpg"', '2019-09-23 21:26:42');
INSERT INTO `spot`
VALUES (4, '大禹导中江',
        '《尚书·禹贡》记述，大禹治水导中江。中江是中国古代水运发达的人工运河，它西起芜湖青弋江、水阳江，流经江、浙，进太湖，入东海。因此芜湖古地名有“中江”之称。当年大禹率领百姓通山川，疏江河，治理中江，变患为利，建立了不朽功勋。',
        null, '"assets/file/1556025997024.jpg"', '2019-09-23 21:26:42');
INSERT INTO `spot`
VALUES (5, '步月桥',
        '步月桥，原名柳阴桥，后又叫小洋桥，1803年建；民国时期改名大洋桥。1953年改为钢筋水泥平桥。1987年7月，改建为拱桥，麻石桥体，白大理石为栏杆，单孔，拱径5米，桥长28米，定名为步月桥。步月桥位于大小镜湖之间，连接两湖，是鸠兹景区中一颗璀璨的明珠。如今，步月桥已经成为芜湖城市中的一道历史痕迹，也是芜湖的一个象征，成为芜湖的代名词。',
        null, '"assets/file/1556025997024.jpg"', '2019-09-23 21:26:42');
INSERT INTO `spot`
VALUES (6, '历史文化长廊',
        '历史文化长廊前12根立柱分别镌刻着繁昌人字洞、南陵古铜冶、吴楚长岸之战、干将莫邪炼剑、李白与天门山、沈括与万春圩、张孝祥与镜湖、芜湖浆染、芜湖铁画、 芜湖米市、渡江第一船、芜湖长江大桥等12根浮雕。', null,
        '"assets/file/1556025997024.jpg"', '2019-09-23 21:26:42');
INSERT INTO `spot`
VALUES (7, '安徽文化名人藏馆', '', null, '["assets/file/1556025997024.jpg"]', '2019-09-23 21:26:42');
INSERT INTO `spot`
VALUES (8, '步文亭', '', null, '["assets/file/1556025997024.jpg"]', '2019-09-23 21:26:42');
INSERT INTO `spot`
VALUES (9, '尺木亭', '', null, '["assets/file/1556025997024.jpg"]', '2019-09-23 21:26:42');
INSERT INTO `spot`
VALUES (10, '干将莫邪', '', null, '["assets/file/1556025997024.jpg"]', '2019-09-23 21:26:42');
INSERT INTO `spot`
VALUES (11, '观岚亭', '', null, '["assets/file/1556025997024.jpg"]', '2019-09-23 21:26:42');
INSERT INTO `spot`
VALUES (12, '湖心亭', '', null, '["assets/file/1556025997024.jpg"]', '2019-09-23 21:26:42');
INSERT INTO `spot`
VALUES (13, '鸠顶泽瑞', '', null, '["assets/file/1556025997024.jpg"]', '2019-09-23 21:26:42');
INSERT INTO `spot`
VALUES (14, '孔融让梨', '', null, '["assets/file/1556025997024.jpg"]', '2019-09-23 21:26:42');
INSERT INTO `spot`
VALUES (15, '立木为信', '', null, '["assets/file/1556025997024.jpg"]', '2019-09-23 21:26:42');
INSERT INTO `spot`
VALUES (16, '柳春园', '', null, '["assets/file/1556025997024.jpg"]', '2019-09-23 21:26:42');
INSERT INTO `spot`
VALUES (17, '亲水广场', '', null, '["assets/file/1556025997024.jpg"]', '2019-09-23 21:26:42');
INSERT INTO `spot`
VALUES (18, '芜湖市美术馆', '', null, '["assets/file/1556025997024.jpg"]', '2019-09-23 21:26:42');
INSERT INTO `spot`
VALUES (19, '芜湖艺术展览馆', '', null, '["assets/file/1556025997024.jpg"]', '2019-09-23 21:26:42');
INSERT INTO `spot`
VALUES (20, '希右亭', '', null, '["assets/file/1556025997024.jpg"]', '2019-09-23 21:26:42');
INSERT INTO `spot`
VALUES (21, '迎宾阁', '', null, '["assets/file/1556025997024.jpg"]', '2019-09-23 21:26:42');
INSERT INTO `spot`
VALUES (22, '凿壁偷光', '', null, '["assets/file/1556025997024.jpg"]', '2019-09-23 21:26:42');
INSERT INTO `spot`
VALUES (23, '繁昌“人字洞”',
        '古人类早在200万~240万年前就开始在长江流域繁衍生息。位于安徽省芜湖市繁昌县境内的古人类遗址人字洞，至今出土了300多件石骨制品，还原了欧亚大陆上迄今发现的最早的古人类活动的冰山一角。 2006年05月25日，人字洞遗址作为旧石器时代古遗址，被国务院批准列入第六批全国重点文物保护单位名单。',
        null, '"assets/file/1556025997024.jpg"', '2019-09-23 21:26:42');
INSERT INTO `spot`
VALUES (24, '张孝祥简介',
        '张孝祥，字安国，自号“于湖居士”。 南宋绍兴二十四年（一一五四年）状元，伟大的爱国词人，也是芜湖历史上唯一的状元。张孝祥青年进入仕途，任建康留守，广南西路安抚使等职。公元九年，受秦桧忌恨，被弹劾落职，在归家祭祀时病逝，时年三十八岁，生平所著《于湖集》四十卷，留传后世。 镜湖原称陶塘，系张孝祥“捐田百亩，汇雨成湖”而成，造后的镜湖面积约284亩。',
        null, '"assets/file/1556025997024.jpg"', '2019-09-23 21:26:42');
INSERT INTO `spot`
VALUES (25, '李白与天门山',
        '安徽芜湖天门山，有历史悠久的天门书院，以及别具特色的铜佛寺。 李白当年所写的“天门山”正是此处，他曾多次游历并且留下了《望天门山》这首脍炙人口的绝作。 《望天门山》李白 天门中断楚江开，碧水东流至此回。 两岸青山相对出，孤帆一片日边来.',
        null, '"assets/file/1556025997024.jpg"', '2019-09-23 21:26:42');
INSERT INTO `spot`
VALUES (26, '沈括与万春圩',
        '在我国水利工程发展史上，北宋时期芜湖县万春圩有着重要的一页。万春圩是当时江南规模最大的圩田，曾几经废建。至宋嘉祐六年（1061年），复议重修获准。宋仁宗赐名“万春圩”。 沈括为此写《万春圩图记》，详细记述评论建圩情况。',
        null, '"assets/file/1556025997024.jpg"', '2019-09-23 21:26:42');
INSERT INTO `spot`
VALUES (27, '吴楚长岸之战',
        '周景王二十五（前525），吴军攻楚，交战于长岸（安徽当涂之博望山）。 楚军司马子鱼战死后，楚军反攻，击败吴军，缴获吴王乘船“余皇”号。吴公子光（即后来的吴王阖闾）为夺回“余皇”，先派人潜伏在“余皇”附近。夜间派兵袭击楚军并高呼：“余皇”，吴军潜伏者轮流答应。 楚军误认为吴军已攻入楚营，大乱。吴军乘势进攻，大败楚军，夺回“余皇”。',
        null, '"assets/file/1556025997024.jpg"', '2019-09-23 21:26:42');
INSERT INTO `spot`
VALUES (28, '渡江第一船',
        '1949年4月20日，由于南京国民党政府拒绝签署国内和平协定，激起了中国共产党和全国人民的愤慨。当晚8时开始，人民解放军的百万雄师万船齐发、乘风破浪，规模空前的渡江战役开始。人民解放军以排山倒海之势，摧毁了国民党军队苦心经营了三个多月的铜（陵）繁（昌）江防。攻打繁昌的军队是隶属中集团军的二十五军和二十七军。任务是突破从澛港到荻港的国民党江防。守备繁昌段江防的是国民党八十八军和二十军各一部。当晚21时15分。由于二三五团一营三连二排五班所乘之船最先到达并最先登上南岸， 因此被成为“百万雄师渡江第一船”，在渡江战役史上留下了光辉的一页。',
        null, '"assets/file/1556025997024.jpg"', '2019-09-23 21:26:42');
INSERT INTO `spot`
VALUES (29, '芜湖浆染',
        '明代科学家宋应星在《天工开物》一书中曾记载：“织造尚松江，浆染尚芜湖”。明清时代，芜湖不仅是全国浆染业中心，还是与松江、苏州、铅山和景德镇齐名的全国五大手工业中心之一。史学家翦伯赞在其主编的《中国史纲要》中说：“江南地区五大手工业的区域，即松江的棉纺织业、苏杭二州的丝织业、芜湖的浆染业、铅山的造纸业和景德镇的制瓷业。 《太函集》卷三十五中记载，万历年间，有个徽商名叫阮弼，在芜湖立局治染，专门染布贩卖，“时购者争求得采，利归染人”，“五方争购者益集其所，转毂遍于吴、越、荆、梁、燕、豫、齐、鲁之间，则又分局而贾要津”。可见，当时的芜湖染布已行销八省，其技术成就与经济规模在当时已达到无与伦比的程度。',
        null, '"assets/file/1556025997024.jpg"', '2019-09-23 21:26:42');
INSERT INTO `spot`
VALUES (30, '芜湖米市',
        '中国历史上 “江南四大米市”分别是安徽芜湖、江西九江、江苏无锡、湖南长沙。 芜湖素有全国“四大米市”之首的美誉，而米市的启动点和发祥地是芜湖今日的弋江区。弋江区因为地处青弋江注入长江的南岸，俗称河南。沿岸人烟密集，集市贸易相当繁荣。 清光绪二十四至三十年间（1898——1904），芜湖米市的稻米出口每年多则500余万石，少则也有300万石。真所谓“堆则如山，出则如江。”',
        null, '"assets/file/1556025997024.jpg"', '2019-09-23 21:26:42');
INSERT INTO `spot`
VALUES (31, '芜湖铁画',
        '芜湖铁画，为中国传统独具风格的工艺品之一，是芜湖市特有的工艺美术品。 芜湖铁画以锤为笔，以铁为墨，以砧为纸，锻铁为画，鬼斧神工，气韵天成。芜湖铁画以历史悠久、风格独特、工艺精湛、技艺高超著称于世。 铁画始于明末清初的康熙年间，由芜湖铁工汤天池与芜湖画家萧尺木相互砥砺而成，至今已有340多年历史。 2006年5月20日，芜湖铁画锻制技艺经国务院批准列入第一批国家级非物质文化遗产名录。',
        null, '"assets/file/1556025997024.jpg"', '2019-09-23 21:26:42');
INSERT INTO `spot`
VALUES (32, '芜湖长江大桥',
        '芜湖长江大桥，是国家“九五”重点交通项目，其桥型为公、铁两用钢桁梁斜拉桥，公路在上层，铁路在下层。铁路桥长10616米，公路桥长6078米，其中跨江桥长2193.7米，含引桥36千米，投资61亿元。 芜湖长江大桥于1997年3月22日正式开工，2000年9月建成通车。',
        null, '"assets/file/1556025997024.jpg"', '2019-09-23 21:26:42');
INSERT INTO `spot`
VALUES (33, '张孝祥与镜湖',
        '张孝祥，南宋著名爱国词人，芜湖历史上唯一的状元。生于明州鄞县（今浙江宁波），少年时阖家迁居安徽省芜湖市。张孝祥二十四年荣登状元之后，“捐田百亩，汇而成湖”，他将自己家后院的一小片洼地开辟为“陶塘”（傍上东晋诗人陶渊明的姓氏外，还有致仕归来陶情适性的蕴意。） 后慢慢扩建到面积达二百多亩。因其水清可鉴，形似圆镜，“水惟不竞形俱鉴”，故更名“镜湖”。',
        null, '"assets/file/1556025997024.jpg"', '2019-09-23 21:26:42');

# INSERT INTO `spot`
# VALUES ('6f0e8dedf9054d56a897cfa988d80287', '3', '4', null, '[]', '2019-04-23 21:13:51');
# INSERT INTO `spot`
# VALUES ('c8688922f637473ba04f8eac4312b7bf', '45', '345345', null, '[\"assets/file/1556025997024.jpg\"]','2019-09-23 21:26:42');

-- ----------------------------
# INSERT INTO `comment`
# VALUES ('63f9feb83179497fa2689321e9b22a1c', '8', '6f0e8dedf9054d56a897cfa988d80287', '很美！', '2019-04-23 21:19:54');
# INSERT INTO `comment`
# VALUES ('7498bb9dbd18477b8d90fc22e93c3108', '1', 'c8688922f637473ba04f8eac4312b7bf', '还会再去一次', '2019-05-03 20:50:06');
# INSERT INTO `comment`
# VALUES ('f190dd875d33407283ea195ac4fef79b', '8', '6f0e8dedf9054d56a897cfa988d80287', '风景如画呀', '2019-05-03 22:10:52');


# INSERT INTO `user`
# VALUES ('8', '17754833705', 'Lyam', 'assets/file/1556026312685.jpg', '000000');
#
# INSERT INTO `admin`
# VALUES ('Lyam', '000000');

